{"pages":[],"posts":[{"title":"Blog创建中遇到的困难以及总结","text":"一直很想有一个能发表自己看法的网页。 在几天前接触到了Hexo+Github的方式来搭建博客。 之后找到了教程，与其学习来搭建博客，我原本以为有着网页基础的我做这个没问题，但是过程中遇到了相当多的困难，我终于知道了自己所学Dreamweaver的不过是这些东西的一部分。 首先来说说我遇到的问题在最初我安装了了最基本的Node.js（Node.js 是一个基于 Chrome V8 引擎的 JavaScript 运行环境。）npm、以及taobao镜像、利用cnmp来安装 hexo的框架这样就成功创建了blog的文件夹（也就是框架）。 然后跟着教程来做，但是发现其中很多的命令无法运行，出现了各种waring、error的报错，一方面是因为教程中所使用的是IOS系统，而另一方面，是因为我没有下载Git（使用后感觉像是高级一些的cmd指令运行），如果你一开始就使用Git可以避免掉很多的麻烦，如果不配置环境就运行Git来操作，安装完成之后，你可以在Git bash或者Git cmd中运行指令，而操作系统中的大部分指令Git都可以执行，为了弄明白Git，我查阅了一些资料（当然在这之前要学会Linux的一些基本语法以及使用方式）。 当hexo init运行时报错WARN git clone failed. Copying data insteadWARN Failed to install dependencies. Please run ‘npm install’ manually! 下载安装Git 然后在git bash命令行里面进行hexo init就可以了 之后一路顺利，安装了主题，本地文件无误后，注册github并且部署上传，在第一次部署命令后（hexo g）需要确定你的用户名以及密码，可用指令输入安装地址、路径后直接安装，也可以直接在Github上找到安装包，解压到themes文件夹，（存于themes文件夹，我的yiliya主题安装失败，网速难以下载，之后找到了现在使用的icarus主题，遇到了很多困难。）打开blog的_congif.yml站点配置文件的themes修改为你的主题名字清理一下、缓冲、预览上传即可。 如果你不小心删除了blog文件夹，那么将其放回到原位置，用Git bash打开后重新 hexo g上传部署，输入用户名和密码即可，最好定期备份blog文件夹（好像也可以在Github上打包重新下载）。 博客搭建完成，教程可在BiliBili上找到。 Icarus中遇到的问题 安装了Icarus主题后，我遇到了头像问题，头像存储于主题配置文件的images文件夹中即可。 icarus的菜单汉化问题，我第一次知道了修改主题的语言原来要到博客的站点配置文件_congif.yml里的language行来调整，比如中文是“zh-Hans”，而语言文件存在于你的主题的languages文件夹中,也就是说，设计者提前弄好了语言文件，你只需要在你的站点配置文件夹中来选择他所准备好的语言即可，但是我所选择的icarus不太一样，他的导航栏（菜单）始终没有办法汉化，所以我只能采取了暴力的方式，直接在主题配置文件中修改了菜单名称，之后也就成功了~开心😊 之后的icarus主题我会继续努力去学习。 为什么要有博客？以后会记录什么？我不太喜欢记录我学习到的东西，因为我认为专业的知识要牢牢地记在脑子里，我更偏向于将我遇到了困难，或者较少用到的东西记录在博客，以及感受、分享、总结。我在上面的解决问题中都是我遇到的问题，查了很久，创建博客的过程记的并不完全，所以要搭建博客，请查阅其他大佬的教程，配置了Git后我遇到的很多问题基本可能都碰不到。 以后会分享一些东西，一些小知识，还有各种游戏的攻略以及我的旅程和学习成果。 通过这次搭建博客看到了什么？差距和道路。 差距 我在这方面和很多人差距很大，我看到了很多大佬，他们在这方面的能力真的真的很强，对于博客搭建的理解不难让人认为他们在别的领域也是很强大的，我所学会的HTML和CSS在这里用的很少，我也知道这是和我所想走的是一条完全不同的道路，但又息息相关。 这次的博客似乎更像是帮你跳过了前半端最难的地方，直接拿过来模板，然后通过配置进行个性化，再上传的方式，前面的过程不难猜，设计创造网页。这是不同的。","link":"/2020/03/22/%E5%9B%BE%E7%89%87%E6%B5%8B%E8%AF%95/"}],"tags":[{"name":"总结","slug":"总结","link":"/tags/%E6%80%BB%E7%BB%93/"}],"categories":[]}